"MODERATORS:Bret Baier (Fox News);Megyn Kelly (Fox News); and Chris Wallace (Fox News)KELLY: Welcome to the first debate night of the 2016 presidential campaign, live from Quicken Loans Arena in Cleveland, Ohio. I'm Megyn Kelly... [applause]... along with my co-moderators, Brett Baier and Chris Wallace. Tonight... [applause] Nice. Tonight, thousands of people here in the Q, along with millions of voters at home will get their very first chance to see the candidates face off in a debate, answering the questions you want answered. BAIER: Less than a year from now, in this very arena, one of these 10 candidates or one of the seven on the previous debate tonight will accept the Republican party's nomination. [applause] Tonight's candidates were selected based on an average of five national polls. Just a few hours ago, you heard from the candidates ranked 11th through 17. And now, the prime-time event, the top 10. WALLACE: Also of note, Fox News is partnering for tonight's debate with Facebook. For the past several weeks, we've been asking you for questions for the candidates on Facebook. Nearly 6 million of you, 6 million, viewed the debate videos on our site, and more than 40,000 of you submitted questions: some of which you will hear us asking the candidates tonight. KELLY: As for the candidates who will be answering those questions? Here they are. Positioned on the stage by how they stand in the polls, in the center of the stage tonight, businessman Donald Trump. [applause] Former Florida Governor Jeb Bush. [applause] Wisconsin Governor Scott Walker. [applause] Former Arkansas Governor Mike Huckabee. [applause] BAIER: Neurosurgeon, Dr. Ben Carson. [applause] Texas Senator Ted Cruz. [applause] Florida Senator Marco Rubio. [applause] WALLACE: Kentucky Senator Rand Paul. [applause] New Jersey Governor Chris Christie. [applause] And your very own governor of Ohio... [applause] ... John Kasich. [applause] WALLACE: Brett -- Brett, I think you would call that a home field advantage. BAIER: It might be. It might be. We'll see. [UNKNOWN]: Is this in the rules? An objection's coming. BAIER: It might be. The rules for tonight are simple. One minute for answers, 30 seconds for follow-ups. And if a candidate runs over, you'll hear this. Pleasant, no? We also have a big crowd here with us tonight in the home of the Cavaliers, as I mentioned. And while we expect them... [applause] ... we expect them to be enthusiastic, as you heard, we don't want to take anything away from the valuable time for the candidate. So, we're looking for somewhere between a reaction to a LeBron James dunk and the Cleveland Public Library across the street. [laughter] Somewhere there, we'll find a balance tonight. Without further ado, let's begin. BAIER: Gentlemen, we know how much you love hand-raising questions. So we promise, this is the only one tonight: the only one. Is there anyone on stage, and can I see hands, who is unwilling tonight to pledge your support to the eventual nominee of the Republican party and pledge to not run an independent campaign against that person. Again, we're looking for you to raise your hand now -- raise your hand now if you won't make that pledge tonight. Mr. Trump. [booing] Mr. Trump to be clear, you're standing on a Republican primary debate stage. TRUMP: I fully understand. BAIER: The place where the RNC will give the nominee the nod. TRUMP: I fully understand. BAIER: And that experts say an independent run would almost certainly hand the race over to Democrats and likely another Clinton. You can't say tonight that you can make that pledge? TRUMP: I cannot say. I have to respect the person that, if it's not me, the person that wins, if I do win, and I'm leading by quite a bit, that's what I want to do. I can totally make that pledge. If I'm the nominee, I will pledge I will not run as an independent. But -- and I am discussing it with everybody, but I'm, you know, talking about a lot of leverage. We want to win, and we will win. But I want to win as the Republican. I want to run as the Republican nominee. BAIER: So tonight, you can't say if another one of these... PAUL: This is what's wrong! BAIER: OK. PAUL: I mean, this is what's wrong. He buys and sells politicians of all stripes, he's already... BAIER: Dr. Paul. PAUL: Hey, look, look! He's already hedging his bet on the Clintons, OK? So if he doesn't run as a Republican, maybe he supports Clinton, or maybe he runs as an independent... BAIER: OK. PAUL: ...but I'd say that he's already hedging his bets because he's used to buying politicians. TRUMP: Well, I've given him plenty of money. BAIER: Just to be clear, you can't make a -- we're gonna -- we're going to move on. You're not gonna make the pledge tonight? TRUMP: I will not make the pledge at this time. BAIER: OK. Alright. [laughter and boing] KELLY: Gentlemen, our first round of questions is on the subject of electability in the general election, and we start tonight with you, Dr. Carson. You are a successful neurosurgeon, but you admit that you have had to study up on foreign policy, saying there's a lot to learn. Your critics say that your inexperience shows. You've suggested that the Baltic States are not a part of NATO, just months ago you were unfamiliar with the major political parties and government in Israel, and domestically, you thought Alan Greenspan had been treasury secretary instead of federal reserve chair. Aren't these basic mistakes, and don't they raise legitimate questions about whether you are ready to be president? CARSON: Well, I could take issue with -- with all of those things, but we don't have time. But I will say, we have a debate here tonight, and we will have an opportunity to explore those areas, and I'm looking very much forward to demonstrating that, in fact, the thing that is probably most important is having a brain, and to be able to figure things out and learn things very rapidly. So, you know, experience comes from a large number of different arenas, and America became a great nation early on not because it was flooded with politicians, but because it was flooded with people who understood the value of personal responsibility, hard work, creativity, innovation, and that's what will get us on the right track now, as well. WALLACE: Senator Rubio, when Jeb Bush announced his candidacy for presidency, he said this: \"There's no passing off responsibility when you're a governor, no blending into the legislative crowd.\" Could you please address Governor Bush across the stage here, and explain to him why you, someone who has never held executive office, are better prepared to be president than he is, a man who you say did a great job running your state of Florida for eight years. RUBIO: Well, thank you for the question, Chris, and it's great to be here tonight. Let me begin by saying this: I'm not new to the political process; I was making a contribution as the speaker of the third largest and most diverse state in the country well before I even got into the Senate. I would add to that that this election cannot be a resume competition. It's important to be qualified, but if this election is a resume competition, then Hillary Clinton's gonna be the next president, because she's been in office and in government longer than anybody else running here tonight. Here's what this election better be about: This election better be about the future, not the past. It better be about the issues our nation and the world is facing today, not simply the issues we once faced. This country is facing an economy that has been radically transformed. You know, the largest retailer in the country and the world today, Amazon, doesn't even own a single store? And these changes have been disruptive. They have changed people's lives. The jobs that once sustained our middle class, they either don't pay enough or they are gone, and we need someone that understands that as our nominee. If I'm our nominee, how is Hillary Clinton gonna lecture me about living paycheck to paycheck? I was raised paycheck to paycheck. How is she -- how is she gonna lecture me -- how is she gonna lecture me about student loans? I owed over $100,000 just four years ago. If I'm our nominee, we will be the party of the future. [applause] BAIER: Governor Bush, you have insisted that you're your own man. You say you have a life experience uniquely your own. Not your father's, not your brother's. But there are several opponents on this stage who get big- applause lines in early voting states with this line: quote, \"the last thing the country needs is another Bush in the Oval Office.\" So do you understand the real concern in this country about dynastic politics? BUSH: Absolutely, I do, and I'm gonna run hard, run with heart, and run to win. I'm gonna have to earn this. Maybe the barrier -- the bar's even higher for me. That's fine. I've got a record in Florida. I'm proud of my dad, and I'm certainly proud of my brother. In Florida, they called me Jeb, because I earned it. I cut taxes every year, totaling $19 billion. We were -- we had -- we balanced every budget. We went from $1 billion of reserves to $9 billion of reserves. We were one of two states that went to AAA bond rating. They keep -- they called me Veto Corleone. Because I vetoed 2,500 separate line-items in the budget. [applause] I am my own man. I governed as a conservative, and I govern effectively. And the net effect was, during my eight years, 1.3 million jobs were created. We left the state better off because I applied conservative principles in a purple state the right way, and people rose up. [applause] KELLY: Mr. Trump, one of the things people love about you is you speak your mind and you don't use a politician's filter. However, that is not without its downsides, in particular, when it comes to women. You've called women you don't like \"fat pigs, dogs, slobs, and disgusting animals.\" [laughter] Your Twitter account... TRUMP: Only Rosie O'Donnell. [laughter] KELLY: No, it wasn't. [applause] Your Twitter account... [applause] TRUMP: Thank you. KELLY: For the record, it was well beyond Rosie O'Donnell. TRUMP: Yes, I'm sure it was. KELLY: Your Twitter account has several disparaging comments about women's looks. You once told a contestant on Celebrity Apprentice it would be a pretty picture to see her on her knees. Does that sound to you like the temperament of a man we should elect as president, and how will you answer the charge from Hillary Clinton, who was likely to be the Democratic nominee, that you are part of the war on women? TRUMP: I think the big problem this country has is being politically correct. [applause] I've been challenged by so many people, and I don't frankly have time for total political correctness. And to be honest with you, this country doesn't have time either. This country is in big trouble. We don't win anymore. We lose to China. We lose to Mexico both in trade and at the border. We lose to everybody. And frankly, what I say, and oftentimes it's fun, it's kidding. We have a good time. What I say is what I say. And honestly Megyn, if you don't like it, I'm sorry. I've been very nice to you, although I could probably maybe not be, based on the way you have treated me. But I wouldn't do that. [applause] But you know what, we -- we need strength, we need energy, we need quickness and we need brain in this country to turn it around. That, I can tell you right now. WALLACE: Senator Cruz, your colleague, Senator Paul, right there next to you, said a few months ago he agrees with you on a number of issues, but he says you do nothing to grow the party. He says you feed red meat to the base, but you don't reach out to minorities. You have a toxic relationship with GOP leaders in Congress. You even called the Republican Senate Leader Mitch McConnell a liar recently. [applause] How can you win in 2016 when you're such a divisive figure? CRUZ: Chris, I believe the American people are looking for someone to speak the truth. [applause] If you're looking for someone to go to Washington, to go along to get along, to get -- to agree with the career politicians in both parties who get in bed with the lobbyists and special interests, then I ain't your guy. There is a reason... [applause] .... that we have $18 trillion in debt. Because as conservatives, as Republicans, we keep winning elections. We got a Republican House, we've got a Republican Senate, and we don't have leaders who honor their commitments. I will always tell the truth and do what I said I would do. [applause] BAIER: Governor Christie, you're not exactly the darling of conservatives. You tout your record as a Republican governor in a blue state. On Facebook, the most people talking about you, not surprisingly, come from your state of New Jersey, and one of the top issues they are talking about is the economy. This -- this may be why. Under your watch, New Jersey has undergone nine credit rating downgrades. The state's 44th in private sector growth. You face an employee pension crisis and the Garden State has the third highest foreclosure rate in the country. So why should voters believe that your management of the country's finances would be any different? CHRISTIE: If you think it's bad now, you should've seen it when I got there. [laught and applause] The fact is -- the fact is, in the eight years before I became governor, taxes and fees were raised at the state level 115 times. In the eight years before I became governor, spending was increased 56 percent. And in the eight years before I become governor, taxes and fees were raised at the state level 115 times. In the eight years before I became Governor, spending was increased 56 percent, and in the eight years before I became governor, there was zero net private sector job growth in New Jersey. Zero. For eight years. So, what did we do? We came in, we balanced an $11 billion deficit on a $29 billion budget by cutting over 800 programs in the state budget. We brought the budget into balance with no tax increases. In fact, we vetoed five income tax increases during my time as governor. We cut business taxes $2.3 billion, and we cut regulation by one-third of what my predecessor put in place. And, what's happened since? A hundred ninety-two thousand private sector jobs in the five and a half years I've been governor. We have a lot of work to do in New Jersey, but I am darn proud we've brought our state back. [applause] KELLY: Governor Walker, you've consistently said that you want to make abortion illegal even in cases of rape, incest, or to save the life of the mother. You recently signed an abortion law in Wisconsin that does have an exception for the mother's life, but you're on the record as having objected to it. Would you really let a mother die rather than have an abortion, and with 83 percent of the American public in favor of a life exception, are you too out of the mainstream on this issue to win the general election? WALKER: Well, I'm pro-life, I've always been pro-life, and I've got a position that I think is consistent with many Americans out there in that... [applause] ...in that I believe that that is an unborn child that's in need of protection out there, and I've said many a time that that unborn child can be protected, and there are many other alternatives that can also protect the life of that mother. That's been consistently proven. Unlike Hillary Clinton, who has a radical position in terms of support for Planned Parenthood, I defunded Planned Parenthood more than four years ago, long before any of these videos came out... [applause] ...I've got a position that's in line with everyday America. [applause] WALLACE: Governor Huckabee, like Governor Walker, you have staked out strong positions on social issues. You favor a constitutional amendment banning same sex marriage. You favor a constitutional amendment banning abortions, except for the life of the mother. Millions of people in this country agree with you, but according to the polls, and again this an electability question, according to the polls, more people don't, so how do you persuade enough Independents and Democrats to get elected in 2016? HUCKABEE: Chris, I disagree with the idea that the real issue is a constitutional amendment. That's a long and difficult process. I've actually taken the position that's bolder than that. A lot of people are talking about defunding planned parenthood, as if that's a huge game changer. I think it's time to do something even more bold. I think the next president ought to invoke the Fifth, and Fourteenth Amendments to the constitution now that we clearly know that that baby inside the mother's womb is a person at the moment of conception. The reason we know that it is is because of the DNA schedule that we now have clear scientific evidence on. And, this notion that we just continue to ignore the personhood of the individual is a violation of that unborn child's Fifth and 14th Amendment rights for due process and equal protection under the law. It's time that we recognize the Supreme Court is not the Supreme Being, and we change the policy to be pro-life and protect children instead of rip up their body parts and sell them like they're parts to a Buick. [applause] BAIER: Senator Paul, you recently blamed the rise of ISIS on Republican hawks. You later said that that statement, you could have said it better. But, the statement went on, and you said, quote, \"Everything they've talked about in foreign policy, they've been wrong for the last 20 years.\" Why are you so quick to blame your own party? PAUL: First of all, only ISIS is responsible for the terrorism. Only ISIS is responsible for the depravity. But, we do have to examine, how are we going to defeat ISIS? I've got a proposal. I'm the leading voice in America for not arming the allies of ISIS. [applause]  I've been fighting amidst a lot of opposition from both Hillary Clinton, as well as some Republicans who wanted to send arms to the allies of ISIS. ISIS rides around in a billion dollars worth of U.S. Humvees. It's a disgrace. We've got to stop -- we shouldn't fund our enemies, for goodness sakes. So, we didn't create ISIS -- ISIS created themselves, but we will stop them, and one of the ways we stop them is by not funding them, and not arming them. [applause] KELLY: Governor Kasich, You chose to expand Medicaid in your state, unlike several other governors on this stage tonight, and it is already over budget by some estimates costing taxpayers an additional $1.4 billion in just the first 18 months. You defended your Medicaid expansion by invoking God, saying to skeptics that when they arrive in heaven, Saint Peter isn't going to ask them how small they've kept government, but what they have done for the poor. Why should Republican voters, who generally want to shrink government, believe that you won't use your Saint Peter rationale to expand every government program? KASICH: Well, first of all... [applause] ...first of all, Megyn, you should know that -- that President Reagan expanded Medicaid three or four times. Secondly, I had an opportunity to bring resources back to Ohio to do what? To treat the mentally ill. Ten thousand of them sit in our prisons. It costs $22,500 a year... [applause] ...to keep them in prison. I'd rather get them their medication so they could lead a decent life. Secondly, we are rehabbing the drug-addicted. Eighty percent of the people in our prisons have addictions or problems. We now treat them in the prisons, release them in the community and the recidivism rate is 10 percent and everybody across this country knows that the tsunami of drugs is -- is threatening their very families. So we're treating them and getting them on their feet. And, finally, the working poor, instead of them having come into the emergency rooms where it costs more, where they're sicker and we end up paying, we brought a program in here to make sure that people could get on their feet. And do you know what? Everybody has a right to their God-given purpose. And finally, our Medicaid is growing at one of the lowest rates in the country. And, finally, we went from $8 billion in the hole to $2 billion in the black. We've cut $5 billion in taxes... [timer sounds] ...and we've grown 350,000 jobs. [applause] WALLACE: Gentlemen, we're turning to a new subject that all of you have been talking about and some of you have been disagreeing about, and that is the issue of immigration. Governor Bush, you released a new plan this week on illegal immigration focusing on enforcement, which some suggest is your effort to show that you're not soft on that issue. I want to ask you about a statement that you made last year about illegal immigrants. And here's what you said. \"They broke the law, but it's not a felony, it's an act of love. It's an act of commitment to your family.\" Do you stand by that statement and do you stand by your support for earned legal status? BUSH: I do. I believe that the great majority of people coming here illegally have no other option. They want to provide for their family. But we need to control our border. It's not -- it's our responsibility to pick and choose who comes in. So I -- I've written a book about this and yet this week, I did come up with a comprehensive strategy that -- that really mirrored what we said in the book, which is that we need to deal with E-Verify, we need to deal with people that come with a legal visa and overstay. We need to be much more strategic on how we deal with border enforcement, border security. We need to eliminate the sanctuary cities in this country. It is ridiculous and tragic...[applause]...that people are dying because of the fact that -- that local governments are not following the federal law. There's much to do. And I think rather than talking about this as a wedge issue, which Barack Obama has done now for six long years, the next president -- and I hope to be that president -- will fix this once and for all so that we can turn this into a driver for high sustained economic growth. And there should be a path to earned legal status...[timer sounds] ...for those that are here. Not -- not amnesty, earned legal status, which means you pay a fine and do many things over an extended period of time. WALLACE: Thank you, sir. [applause]  Mr. Trump, it has not escaped anybody's notice that you say that the Mexican government, the Mexican government is sending criminals -- rapists, drug dealers, across the border. Governor Bush has called those remarks, quote, \"extraordinarily ugly.\" I'd like you -- you're right next to him -- tell us -- talk to him directly and say how you respond to that and -- and you have repeatedly said that you have evidence that the Mexican government is doing this, but you have evidence you have refused or declined to share. Why not use this first Republican presidential debate to share your proof with the American people? TRUMP: So, if it weren't for me, you wouldn't even be talking about illegal immigration, Chris. You wouldn't even be talking about it. [applause] This was not a subject that was on anybody's mind until I brought it up at my announcement. And I said, Mexico is sending. Except the reporters, because they're a very dishonest lot, generally speaking, in the world of politics, they didn't cover my statement the way I said it. The fact is, since then, many killings ,murders, crime, drugs pouring across the border, are money going out and the drugs coming in. And I said we need to build a wall, and it has to be built quickly. And I don't mind having a big beautiful door in that wall so that people can come into this country legally. But we need, Jeb, to build a wall, we need to keep illegals out. [cheering and applause] WALLACE: Mr. Trump, I'll give you 30 seconds -- I'll give you 30 seconds to answer my question, which was, what evidence do you have, specific evidence that the Mexican government is sending criminals across the border? Thirty seconds. TRUMP: Border Patrol, I was at the border last week. Border Patrol, people that I deal with, that I talk to, they say this is what's happening. Because our leaders are stupid. Our politicians are stupid. And the Mexican government is much smarter, much sharper, much more cunning. And they send the bad ones over because they don't want to pay for them. They don't want to take care of them. Why should they when the stupid leaders of the United States will do it for them? And that's what is happening whether you like it or not. [cheering and applause] WALLACE: All right. Obviously there's a lot more to talk about this. We're going to have more questions for the candidates on illegal immigration, plus other key topics including your questions on Facebook. [video clip begins] UNIDENTIFIED MALE: What will be your plan on making immigration easier for those that want to do it legally? UNIDENTIFIED MALE: What specific steps would you take to contain the growth of ISIS? UNIDENTIFIED FEMALE: I'd like to know what the candidates are going to do so that I feel safe in my own country again. [video clip ends] [commercial break] WALLACE: Welcome back to FOX News/Facebook Republican Debate Night. We're going to continue the questions now on illegal immigration. We kind of ended with a cliffhanger there. So let's continue the conversation. Governor Kasich, I know you don't like to talk about Donald Trump. But I do want to ask you about the merit of what he just said. When you say that the American government is stupid, that the Mexican government is sending criminals, that we're being bamboozled, is that an adequate response to the question of illegal immigration? KASICH: Chris, first of all, I was just saying to Chris Christie, they say we're outspoken, we need to take lessons from Donald Trump if we're really going to learn it. Here is the thing about Donald Trump. Donald Trump is hitting a nerve in this country. He is. He's hitting a nerve. People are frustrated. They're fed up. They don't think the government is working for them. And for people who want to just tune him out, they're making a mistake. Now, he's got his solutions. Some of us have other solutions. You know, look, I balanced the federal budget as one of the chief architects when I was in Washington. Hasn't been done since. I was a military reformer. I took the state of Ohio from an $8 billion hole and a 350,000 job loss to a $2 billion surplus and a gain of 350,000 jobs. WALLACE: Respectfully, can we talk about illegal immigration? KASICH: But the point is that we all have solutions. Mr. Trump is touching a nerve because people want the wall to be built. They want to see an end to illegal immigration. They want to see it, and we all do. But we all have different ways of getting there. And you're going to hear from all of us tonight about what our ideas are. WALLACE: All right, well, Senator Rubio, let me see if I can do better with you. Is it as simple as our leaders are stupid, their leaders are smart, and all of these illegals coming over are criminals? RUBIO: Let me set the record straight on a couple of things. The first is, the evidence is now clear that the majority of people coming across the border are not from Mexico. They're coming from Guatemala, El Salvador, Honduras. Those countries are the source of the people that are now coming in its majority. I also believe we need a fence. The problem is if El Chapo builds a tunnel under the fence, we have to be able to deal with that too. And that's why you need an e-verify system and you need an entry-exit tracking system and all sorts of other things to prevent illegal immigration. But I agree with what Governor Kasich just said. People are frustrated. This is the most generous country in the world when it comes to immigration. There are a million people a year who legally immigrate to the United States, and people feel like we're being taken advantage of. We feel like despite our generosity, we're being taken advantage of. And let me tell you who never gets talked about in these debates. The people that call my office, who have been waiting for 15 years to come to the United States. And they've paid their fees, and they hired a lawyer, and they can't get in. And they're wondering, maybe they should come illegally. [applause] And so these are important issues, and we should address it. It's a serious problem that needs to be addressed, and otherwise we're going to keep talking about this for the next 30 years, like we have for the last 30 years. WALLACE: Governor Walker. [applause] Governor Walker, from 2002 until as recently as 2013, just two years ago, you supported comprehensive immigration reform, including a path to citizenship. Now you say that was a quick reaction to something you hadn't really thought about, and that you've changed your mind. Other than politics, could you explain why in the last two years you've changed your position on a path to citizenship, and are there other past positions that we shouldn't hold you to? WALKER: Chris, I actually said that on your show earlier this year. [crosstalk] I acknowledged that. I said I actually listened to the American people. And I think people across America want a leader who's actually going to listen to them. I talked to border state governors and other elected officials. I look at how this president, particularly through last November, messed up the immigration system in this country. Most importantly, I listened to the people of America. I believe we need to secure the border. I've been to the border with Governor Abbott in Texas and others, seeing the problems that they have there. There is international criminal organizations penetrating our southern based borders, and we need to do something about it. Secure the border, enforce the law, no amnesty, and go forward with the legal immigration system that gives priority to American working families and wages. [applause] WALLACE: Senator Cruz, some 1,400 people submitted questions on this very hot topic of illegal immigration on Facebook, and a number of them were about the murder of Kate Steinle in San Francisco, allegedly shot down by an illegal. Doug Bettencourt sent this question, \"will you support Kate Steinle's Law,\" which would impose a mandatory five-year prison term for an illegal who is deported and then returns to this country? \"And will you defund sanctuary cities for violating federal law?\" CRUZ: Chris, absolutely yes. And not only will I support it...[applause]...I have authored Kate's law in the United States Senate and filed that legislation. I tried to get the Senate to vote to pass Kate's law on the floor of the Senate just one week ago, and the leader of our own party blocked a vote on Kate's law. You know, there was reference made to our leaders being stupid. It's not a question of stupidity. It's that they don't want to enforce the immigration laws. That there are far too many in the Washington cartel that support amnesty. President Obama has talked about fundamentally transforming this country. There's 7 billion people across the face of the globe, many of whom want to come to this country. If they come legally, great. But if they come illegally and they get amnesty, that is how we fundamentally change this country, and it really is striking. A majority of the candidates on this stage have supported amnesty. I have never supported amnesty, and I led the fight against Chuck Schumer's gang of eight amnesty legislation in the Senate. KELLY: Alright, gentlemen, we're gonna switch topics now and talk a bit about terror and national security. Governor Christie. You've said that Senator Paul's opposition to the NSA's collection of phone records has made the United States weaker and more vulnerable, even going so far as to say that he should be called before Congress to answer for it if we should be hit by another terrorist attack. Do you really believe you can assign blame to Senator Paul just for opposing the bulk collection of people's phone records in the event of a terrorist attack? CHRISTIE: Yes, I do. And I'll tell you why: because I'm the only person on this stage who's actually filed applications under the Patriot Act, who has gone before the federal -- the Foreign Intelligence Service court, who has prosecuted and investigated and jailed terrorists in this country after September 11th. I was appointed U.S. attorney by President Bush on September 10th, 2001, and the world changed enormously the next day, and that happened in my state. This is not theoretical to me. I went to the funerals. We lost friends of ours in the Trade Center that day. My own wife was two blocks from the Trade Center that day, at her office, having gone through it that morning. When you actually have to be responsible for doing this, you can do it, and we did it, for seven years in my office, respecting civil liberties and protecting the homeland. And I will make no apologies, ever, for protecting the lives and the safety of the American people. We have to give more tools to our folks to be able to do that, not fewer, and then trust those people and oversee them to do it the right way. As president, that is exactly what I'll do. PAUL: Megyn, may I respond? [applause] May I respond? KELLY: Go ahead, sir. PAUL: I want to collect more records from terrorists, but less records from innocent Americans. The Fourth Amendment was what we fought the Revolution over! John Adams said it was the spark that led to our war for independence, and I'm proud of standing for the Bill of Rights, and I will continue to stand for the Bill of Rights. [applause] CHRISTIE: And -- and, Megyn? Megyn, that's a -- that, you know, that's a completely ridiculous answer. \"I want to collect more records from terrorists, but less records from other people.\" How are you supposed to know, Megyn? PAUL: Use the Fourth Amendment! CHRISTIE: What are you supposed to... PAUL: Use the Fourth Amendment! CHRISTIE: ...how are you supposed to -- no, I'll tell you how you, look... PAUL: Get a warrant! CHRISTIE: Let me tell you something, you go... PAUL: Get a judge to sign the warrant! CHRISTIE: When you -- you know, senator... [crosstalk] KELLY: Governor Christie, make your point. CHRISTIE: Listen, senator, you know, when you're sitting in a subcommittee, just blowing hot air about this, you can say things like that. [applause] When you're responsible for protecting the lives of the American people, then what you need to do is to make sure... PAUL: See, here's the problem. CHRISTIE: ...is to make sure that you use the system the way it's supposed to work. PAUL: Here's the problem, governor. Here's the problem, governor. You fundamentally misunderstand the Bill of Rights. Every time you did a case, you got a warrant from a judge. I'm talking about searches without warrants... CHRISTIE: There is no... PAUL: ...indiscriminately, of all Americans' records, and that's what I fought to end. I don't trust President Obama with our records. I know you gave him a big hug, and if you want to give him a big hug again, go right ahead. [applause] KELLY: Go ahead, governor. CHRISTIE: And you know -- you know, Senator Paul? Senator Paul, you know, the hugs that I remember are the hugs that I gave to the families who lost their people on September 11th. Those are the hugs I remember, and those had nothing to do -- and those had nothing to do with politics, unlike what you're doing by cutting speeches on the floor of the Senate, then putting them on the Internet within half an hour to raise money for your campaign... KELLY: Alright. CHRISTIE: ...and while still putting our country at risk. [crosstalk] KELLY: Alright, we've gotta cut it off there. We have plenty more we want to get to. That was an interesting exchange, thank you for that. CHRISTIE: You know what, Megyn, can I... KELLY: Well, I want to move on, because I have -- we're gonna get to you, governor, but I -- I really wanna get to a Facebook questioner. His name is Alex Chalgren, and he has the following question: [video clip begins] QUESTION:: My question is, how would the candidates stop the treacherous actions of ISIS -- ISIL and its growing influence in the U.S., if they were to become president? [video clip ends] KELLY: Senator Cruz, I wanna talk to you about this, because many of the Facebook users and -- and -- the -- the folks on Facebook wanted the candidates to speak to ISIS tonight. You asked the chairman of the joint chiefs a question: \"What would it take to destroy ISIS in 90 days?\" He told you \"IISIS will only be truly destroyed once they are rejected by the populations in which they hide.\" And then you accused him of pushing Medicaid for the Iraqis. How would you destroy ISIS in 90 days? CRUZ: Megyn, we need a commander in chief that speaks the truth. We will not defeat radical Islamic terrorism so long as we have a president unwilling to utter the words, \"radical Islamic terrorism\". [applause] When I asked General Dempsey, the chairman of the joint chiefs, what would be required militarily to destroy ISIS, he said there is no military solution. We need to change the conditions on the ground so that young men are not in poverty and susceptible to radicalization. That, with all due respect, is nonsense. It's the same answer the State Department gave that we need to give them jobs. What we need is a commander in chief who makes -- clear, if you join ISIS, if you wage jihad on America, then you are signing your death warrant. KELLY: You don't see it as... [applause] ...an ideological problem -- an ideological problem in addition to a military one? [applause] CRUZ: Megyn, of course it's an ideological problem, that's one of the reasons I introduce the Expatriate Terrorist Act in the Senate that said if any American travels to the Middle East and joining ISIS, that he or she forfeits their citizenship so they don't use a passport to come back and wage jihad on Americans. [applause] Yes, it is ideological, and let me contrast President Obama, who at the prayer breakfast, essentially acted as an apologist. He said, \"Well, gosh, the crusades, the inquisitions--\"[timer sounds] We need a president that shows the courage that Egypt's President al-Sisi did, a Muslim, when he called out the radical Islamic terrorists who are threatening the world. [applause] KELLY: Governor Bush, for days on end in this campaign, you struggled to answer a question about whether knowing what we know now... BUSH: ...I remember... KELLY: ...we would've invaded Iraq... BUSH: ...I remember, Megyn. [laughter] KELLY: I remember it too, and ISIS, of course, is now thriving there. You finally said, \"No.\" To the families of those who died in that war who say they liberated a country and deposed a ruthless dictator, how do you look at them now and say that your brothers war was a mistake? BUSH: Knowing what we know now, with faulty intelligence, and not having security be the first priority when -- when we invaded, it was a mistake. I wouldn't have gone in, however, for the people that did lose their lives, and the families that suffer because of it -- I know this full well because as governor of the state of Florida, I called every one of them. Every one of them that I could find to tell them that I was praying for them, that I cared about them, and it was really hard to do. And, every one of them said that their child did not die in vain, or their wife, of their husband did not die in vain. So, why it was difficult for me to do it was based on that. Here's the lesson that we should take from this, which relates to this whole subject. Barack Obama became president, and he abandoned Iraq. He left, and when he left Al Qaida was done for. ISIS was created because [timer sounds] of the void that we left, and that void now exists as a caliphate the size of Indiana. To honor the people that died, we need to -- we need to --- stop the -- Iran agreement, for sure, because the Iranian mullahs have their blood on their hands, and we need to take out ISIS with every tool at our disposal. [applause] KELLY: Governor Walker, in February you said that we needed to gain partners in the Arab world. Which Arab country not already in the U.S. led coalition has potential to be our greatest partner? WALKER: I don't know about additional ones. We need to focus on the ones we have. You look at Egypt, probably the best relationship we've had in Israel, at least in my lifetime, incredibly important. You look at the Saudis -- in fact, earlier this year, I met with Saudi leaders, and leaders from the United Arab Emirates, and I asked them what's the greatest challenge in the world today? Set aside the Iran deal. They said it's the disengagement of America. We are leading from behind under the Obama-Clinton doctrine -- America's a great country. We need to stand up and start leading again, and we need to have allies, not just in Israel, but throughout the Persian Gulf. KELLY: Dr. Carson, in one of his first acts as commander in chief, President Obama signed an executive order banning enhanced interrogation techniques in fighting terror. As president, would you bring back water boarding? CARSON: Well, thank you, Megyn, I wasn't sure I was going to get to talk again. [applause] KELLY: We have a lot for you, don't worry. [laughter and applause] Fear not, you may rue that request. CARSON: Alright. You know, what we do in order to get the information that we need is our business, and I wouldn't necessarily be broadcasting what we're going to do. [applause] We. . .uh. . .we've gotten into this -- this mindset of fighting politically correct wars. There is no such thing as a politically correct war. [applause] And, the left, of course, will say Carson doesn't believe in the Geneva Convention. Carson doesn't believe in fighting stupid wars. And -- and what we have to remember is we want to utilize the tremendous intellect that we have in the military to win wars. And I've talked to a lot of the generals, a lot of our advanced people. And believe me, if we gave them the mission, which is what the commander-in-chief does, they would be able to carry it out. And if we don't tie their hands behind their back, they will do it...[timer sounds]...extremely effectively. [applause] BAIER: Gentlemen, the next series of questions deals with ObamaCare and the role of the federal government. Mr. Trump, ObamaCare is one of the things you call a disaster. TRUMP: A complete disaster, yes. BAIER: Saying it needs to be repealed and replaced. TRUMP: Correct. BAIER: Now, 15 years ago, you called yourself a liberal on health care. You were for a single-payer system, a Canadian-style system. Why were you for that then and why aren't you for it now? TRUMP: First of all, I'd like to just go back to one. In July of 2004, I came out strongly against the war with Iraq, because it was going to destabilize the Middle East. And I'm the only one on this stage that knew that and had the vision to say it. And that's exactly what happened. BAIER: But on ObamaCare... TRUMP: And the Middle East became totally destabilized. So I just want to say. As far as single payer, it works in Canada. It works incredibly well in Scotland. It could have worked in a different age, which is the age you're talking about here. What I'd like to see is a private system without the artificial lines around every state. I have a big company with thousands and thousands of employees. And if I'm negotiating in New York or in New Jersey or in California, I have like one bidder. Nobody can bid. You know why? Because the insurance companies are making a fortune because they have control of the politicians, of course, with the exception of the politicians on this stage. But they have total control of the politicians. They're making a fortune. Get rid of the artificial lines and you will have...[timer sounds]...yourself great plans. And then we have to take care of the people that can't take care of themselves. And I will do that through a different system. [crosstalk] BAIER: Mr. Trump, hold up one second. PAUL: I've got a news flash... BAIER: All right, now, hold on, Senator Paul... PAUL: News flash, the Republican Party's been fighting against a single-payer system... BAIER: OK. PAUL: -- for a decade. So I think you're on the wrong side of this if you're still arguing for a single-payer system. TRUMP: I'm not -- I'm not are -- I don't think you heard me. You're having a hard time tonight. BAIER: All right, let me... [applause] Mr. Trump, it's not just your past support for single- payer health care. You've also supported a host of other liberal policies. Use -- you've also donated to several Democratic candidates, Hillary Clinton included, Nancy Pelosi. You explained away those donations saying you did that to get business-related favors. And you said recently, quote, \"When you give, they do whatever the hell you want them to do.\" TRUMP: You'd better believe it. BAIER: So what specifically did... UNIDENTIFIED MALE: That's true. BAIER: -- they do? TRUMP: If I ask them, if I need them, you know, most of the people on this stage I've given to, just so you understand, a lot of money. RUBIO: Not me. HUCKABEE: Not me. [laughter] "